{
  "_name_or_path": "crocutacrocuto/dinov2-large-MEG6-5",
  "apply_layernorm": true,
  "architectures": [
    "Dinov2ForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "drop_path_rate": 0.0,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 1024,
  "id2label": {
    "0": "aardvark",
    "1": "baboon",
    "2": "badger",
    "3": "bird",
    "4": "black-and-white colobus",
    "5": "blue duiker",
    "6": "blue monkey",
    "7": "buffalo",
    "8": "bushbuck",
    "9": "bushpig",
    "10": "chimpanzee",
    "11": "civet_genet",
    "12": "elephant",
    "13": "galago_potto",
    "14": "golden cat",
    "15": "gorilla",
    "16": "guineafowl",
    "17": "hyrax",
    "18": "jackal",
    "19": "leopard",
    "20": "lhoests monkey",
    "21": "mandrill",
    "22": "mongoose",
    "23": "monkey",
    "24": "pangolin",
    "25": "porcupine",
    "26": "red colobus_red-capped mangabey",
    "27": "red duiker",
    "28": "rodent",
    "29": "serval",
    "30": "spotted hyena",
    "31": "squirrel",
    "32": "water chevrotain"
  },
  "image_size": 518,
  "initializer_range": 0.02,
  "label2id": {
    "aardvark": 0,
    "baboon": 1,
    "badger": 2,
    "bird": 3,
    "black-and-white colobus": 4,
    "blue duiker": 5,
    "blue monkey": 6,
    "buffalo": 7,
    "bushbuck": 8,
    "bushpig": 9,
    "chimpanzee": 10,
    "civet_genet": 11,
    "elephant": 12,
    "galago_potto": 13,
    "golden cat": 14,
    "gorilla": 15,
    "guineafowl": 16,
    "hyrax": 17,
    "jackal": 18,
    "leopard": 19,
    "lhoests monkey": 20,
    "mandrill": 21,
    "mongoose": 22,
    "monkey": 23,
    "pangolin": 24,
    "porcupine": 25,
    "red colobus_red-capped mangabey": 26,
    "red duiker": 27,
    "rodent": 28,
    "serval": 29,
    "spotted hyena": 30,
    "squirrel": 31,
    "water chevrotain": 32
  },
  "layer_norm_eps": 1e-06,
  "layerscale_value": 1.0,
  "mlp_ratio": 4,
  "model_type": "dinov2",
  "num_attention_heads": 16,
  "num_channels": 3,
  "num_hidden_layers": 24,
  "out_features": [
    "stage24"
  ],
  "out_indices": [
    24
  ],
  "patch_size": 14,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "reshape_hidden_states": true,
  "stage_names": [
    "stem",
    "stage1",
    "stage2",
    "stage3",
    "stage4",
    "stage5",
    "stage6",
    "stage7",
    "stage8",
    "stage9",
    "stage10",
    "stage11",
    "stage12",
    "stage13",
    "stage14",
    "stage15",
    "stage16",
    "stage17",
    "stage18",
    "stage19",
    "stage20",
    "stage21",
    "stage22",
    "stage23",
    "stage24"
  ],
  "torch_dtype": "float32",
  "transformers_version": "4.47.0",
  "use_swiglu_ffn": false
}
